function PTzuowen(a,b)
%a表示行数，b列数，

% a=15;b=15;
c=6;d=15;
%c为行间距大小，d为方格大小
p=zeros(a*(d-1)+a*c+2*a+2,(d+1)*b+1);%令矩阵的所有默认值为0
p1=zeros(2+c+d,(d+1)*b+1);%定义一排方格的零矩阵
p2=ones(d,d);%一个方格的长与宽

p1(2:c+1,1:(d+1)*b+1)=[zeros(c,1),ones(c,b*(d+1)-1),zeros(c,1)];%对循环后的一排方格开头加行间距
for i=1:b
    p1(c+2+1:c+2+d,(d+1)*i-d+1:(d+1)*i)=p2;%以自定义的列为单位，根据方格大小对p1的全0矩阵进行赋值为1的操作，来用矩阵模拟方格宽度
end

for j=1:a
    p((c+d+2)*(j-1)+1:(c+d+2)*j,:)=p1;%对行进行循环，赋值给p
end
p(end,:)=zeros(1,b*d+b+1);
% p(1:(fix(c/2)),:)=ones(fix(fix(c/2)),a+1+a*d);
imshow(p)%输出二值化灰度图像，0为黑色，1为白色
